Revit 2024 API
AssetProperty.Name Property
Get the name of the AssetProperty
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Name { get; }
Visual Basic
Public ReadOnly Property Name As String
	Get
Visual C++
public:
property String^ Name {
	String^ get ();
}
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace